In [2]:
import json
import numpy as np
import pandas as pd

In [9]:
json_data = json.dumps({1: {'a': 1, 'b': 2}, 2: {'a': 3, 'b': 4}})

In [11]:
df = pd.read_json(json_data, orient='index')
df

   a  b
1  1  2
2  3  4

In [13]:
df.to_json()

'{"a":{"1":1,"2":3},"b":{"1":2,"2":4}}'

In [18]:
feb_runs = [
    11.56, 12, 
    2.34, 3.63, 2.85, 3.06, 3.92, 7.87, 12.5, 
    2.81, 3.8, 2.65, 7.5, 2.63, 14, 13.21, 
    1.28, 1.88, 2.64, 5.20, 3.76, 7.87, 12.59, 
    2.81, 2.81, 3.45
]
buckets = [0, 3, 8, 15]
cuts = pd.cut(feb_runs, buckets)
cuts

[(8, 15], (8, 15], (0, 3], (3, 8], (0, 3], ..., (3, 8], (8, 15], (0, 3], (0, 3], (3, 8]]
Length: 26
Categories (3, interval[int64]): [(0, 3] < (3, 8] < (8, 15]]

In [19]:
cuts.codes

array([2, 2, 0, 1, 0, 1, 1, 1, 2, 0, 1, 0, 1, 0, 2, 2, 0, 0, 0, 1, 1, 1,
       2, 0, 0, 1], dtype=int8)

In [20]:
cuts.categories

IntervalIndex([(0, 3], (3, 8], (8, 15]],
              closed='right',
              dtype='interval[int64]')

In [21]:
pd.value_counts(cuts)

(3, 8]     10
(0, 3]     10
(8, 15]     6
dtype: int64

In [23]:
bucket_names = ["Slept too Long Run", "Regular Run", "Log Run/Workout"]
cuts = pd.cut(feb_runs, buckets, labels=bucket_names)
cuts

[Log Run/Workout, Log Run/Workout, Slept too Long Run, Regular Run, Slept too Long Run, ..., Regular Run, Log Run/Workout, Slept too Long Run, Slept too Long Run, Regular Run]
Length: 26
Categories (3, object): [Slept too Long Run < Regular Run < Log Run/Workout]

In [24]:
pd.value_counts(cuts)

Regular Run           10
Slept too Long Run    10
Log Run/Workout        6
dtype: int64

In [25]:
cuts = pd.qcut(feb_runs, 4)
cuts

[(7.87, 14.0], (7.87, 14.0], (1.2790000000000001, 2.81], (2.81, 3.695], (2.81, 3.695], ..., (3.695, 7.87], (7.87, 14.0], (1.2790000000000001, 2.81], (1.2790000000000001, 2.81], (2.81, 3.695]]
Length: 26
Categories (4, interval[float64]): [(1.2790000000000001, 2.81] < (2.81, 3.695] < (3.695, 7.87] < (7.87, 14.0]]

In [26]:
pd.value_counts(cuts)

(1.2790000000000001, 2.81]    9
(3.695, 7.87]                 7
(7.87, 14.0]                  6
(2.81, 3.695]                 4
dtype: int64

In [29]:
race_locations = pd.DataFrame({ 
    'location': [
        "Ocean Breeze Athletic Complex - New York, NY", 
        "The Armory - New York, NY", 
        "Tod's Point - Old Greenwich, CT",
        "Franklin D. Roosevelt State Park - Yorktown Heights, NY"
    ],
    'race_count': [3, 2, 1, 2]
})
race_locations

                                            location  race_count
0       Ocean Breeze Athletic Complex - New York, NY           3
1                          The Armory - New York, NY           2
2                    Tod's Point - Old Greenwich, CT           1
3  Franklin D. Roosevelt State Park - Yorktown He...           2

In [34]:
locations: pd.Series = race_locations.T.loc['location']
locations

0         Ocean Breeze Athletic Complex - New York, NY
1                            The Armory - New York, NY
2                      Tod's Point - Old Greenwich, CT
3    Franklin D. Roosevelt State Park - Yorktown He...
Name: location, dtype: object

In [35]:
locations.str.contains('NY')

0     True
1     True
2    False
3     True
Name: location, dtype: bool

In [39]:
pattern = r"([A-Za-z'\.\s]+) - ([A-Za-z'\s]+), ([A-Z]{2})"
locations.str.findall(pattern)

0      [(Ocean Breeze Athletic Complex, New York, NY)]
1                         [(The Armory, New York, NY)]
2                   [(Tod's Point, Old Greenwich, CT)]
3    [(Franklin D. Roosevelt State Park, Yorktown H...
Name: location, dtype: object

In [42]:
matches = locations.str.findall(pattern).str[0]
matches

0        (Ocean Breeze Athletic Complex, New York, NY)
1                           (The Armory, New York, NY)
2                     (Tod's Point, Old Greenwich, CT)
3    (Franklin D. Roosevelt State Park, Yorktown He...
Name: location, dtype: object

In [44]:
states = matches.str.get(2)
states

0    NY
1    NY
2    CT
3    NY
Name: location, dtype: object

In [51]:
# Flatten data by using hierarchical indexing
exercises = pd.Series([2.1, 1, 0.5, 2, 2.15], index=[['run', 'run', 'run', 'walk', 'run'], [1, 2, 3, 4, 5]])
exercises

run   1    2.10
      2    1.00
      3    0.50
walk  4    2.00
run   5    2.15
dtype: float64

In [52]:
exercises.unstack()

        1    2    3    4     5
run   2.1  1.0  0.5  NaN  2.15
walk  NaN  NaN  NaN  2.0   NaN

In [53]:
exercises.unstack().stack()

run   1    2.10
      2    1.00
      3    0.50
      5    2.15
walk  4    2.00
dtype: float64

In [54]:
exercises.swaplevel(0, 1)

1  run     2.10
2  run     1.00
3  run     0.50
4  walk    2.00
5  run     2.15
dtype: float64

In [55]:
exercises.sort_index(level=0)

run   1    2.10
      2    1.00
      3    0.50
      5    2.15
walk  4    2.00
dtype: float64

In [56]:
exercises.sum(level=0)

run     5.75
walk    2.00
dtype: float64

In [57]:
race_locations.set_index(['location'])

                                                    race_count
location
Ocean Breeze Athletic Complex - New York, NY                 3
The Armory - New York, NY                                    2
Tod's Point - Old Greenwich, CT                              1
Franklin D. Roosevelt State Park - Yorktown Hei...           2

In [61]:
users = pd.DataFrame({
    'username': ['andy', 'joe', 'tom', 'fish'],
    'first': ['Andrew', 'Joseph', 'Thomas', 'Benjamin'],
    'last': ['Jarombek', 'Smith', 'Caulfield', 'Fishbein']
})
users

  username     first       last
0     andy    Andrew   Jarombek
1      joe    Joseph      Smith
2      tom    Thomas  Caulfield
3     fish  Benjamin   Fishbein

In [62]:
runs = pd.DataFrame({
    'username': ['andy', 'joe', 'andy', 'fish'],
    'date': ['2020-02-28', '2020-02-29', '2020-03-01', '2020-02-28'],
    'distance': [2.1, 8, 13, 5],
    'minutes': [16, 54, 92, 30],
    'seconds': [5, 51, 0, 10]
})
runs

  username        date  distance  minutes  seconds
0     andy  2020-02-28       2.1       16        5
1      joe  2020-02-29       8.0       54       51
2     andy  2020-03-01      13.0       92        0
3     fish  2020-02-28       5.0       30       10

In [63]:
# Implicitly merge on the 'username' column in users and runs.  This is similar to a SQL INNER JOIN.
pd.merge(users, runs)

  username     first      last        date  distance  minutes  seconds
0     andy    Andrew  Jarombek  2020-02-28       2.1       16        5
1     andy    Andrew  Jarombek  2020-03-01      13.0       92        0
2      joe    Joseph     Smith  2020-02-29       8.0       54       51
3     fish  Benjamin  Fishbein  2020-02-28       5.0       30       10

In [64]:
pd.merge(users, runs, how='inner')

  username     first      last        date  distance  minutes  seconds
0     andy    Andrew  Jarombek  2020-02-28       2.1       16        5
1     andy    Andrew  Jarombek  2020-03-01      13.0       92        0
2      joe    Joseph     Smith  2020-02-29       8.0       54       51
3     fish  Benjamin  Fishbein  2020-02-28       5.0       30       10

In [65]:
pd.merge(users, runs, how='outer')

  username     first       last        date  distance  minutes  seconds
0     andy    Andrew   Jarombek  2020-02-28       2.1     16.0      5.0
1     andy    Andrew   Jarombek  2020-03-01      13.0     92.0      0.0
2      joe    Joseph      Smith  2020-02-29       8.0     54.0     51.0
3      tom    Thomas  Caulfield         NaN       NaN      NaN      NaN
4     fish  Benjamin   Fishbein  2020-02-28       5.0     30.0     10.0

In [66]:
pd.merge(users, runs, left_on='username', right_on='username')

  username     first      last        date  distance  minutes  seconds
0     andy    Andrew  Jarombek  2020-02-28       2.1       16        5
1     andy    Andrew  Jarombek  2020-03-01      13.0       92        0
2      joe    Joseph     Smith  2020-02-29       8.0       54       51
3     fish  Benjamin  Fishbein  2020-02-28       5.0       30       10

In [78]:
# Some ski trails I went on.
morning = pd.Series(['Left Bank', 'West Way', 'Winding Brook', 'Panorama', 'Wild Turkey', 'Cutter'])
afternoon = pd.Series(['Wild Turkey', 'Jericho', 'Bear Crossing', 'Upper Whitetail', 'Lower Whitetail'])

pd.concat([morning, afternoon])

0          Left Bank
1           West Way
2      Winding Brook
3           Panorama
4        Wild Turkey
5             Cutter
0        Wild Turkey
1            Jericho
2      Bear Crossing
3    Upper Whitetail
4    Lower Whitetail
dtype: object

In [79]:
# Passing axis=1 as a parameter concatenates along the x-axis (concats columns), resulting in a data frame.
pd.concat([morning, afternoon], axis=1)

               0                1
0      Left Bank      Wild Turkey
1       West Way          Jericho
2  Winding Brook    Bear Crossing
3       Panorama  Upper Whitetail
4    Wild Turkey  Lower Whitetail
5         Cutter              NaN

In [80]:
# By default concat with axis=1 performs an outer join on the indexes of each original Series.
pd.concat([morning, afternoon], axis=1, join='outer')

               0                1
0      Left Bank      Wild Turkey
1       West Way          Jericho
2  Winding Brook    Bear Crossing
3       Panorama  Upper Whitetail
4    Wild Turkey  Lower Whitetail
5         Cutter              NaN

In [81]:
# This behavior can be altered by passing join='inner' as an argument.
pd.concat([morning, afternoon], axis=1, join='inner')

               0                1
0      Left Bank      Wild Turkey
1       West Way          Jericho
2  Winding Brook    Bear Crossing
3       Panorama  Upper Whitetail
4    Wild Turkey  Lower Whitetail

In [82]:
pd.concat([morning, afternoon], keys=['morning', 'afternoon'])

morning    0          Left Bank
           1           West Way
           2      Winding Brook
           3           Panorama
           4        Wild Turkey
           5             Cutter
afternoon  0        Wild Turkey
           1            Jericho
           2      Bear Crossing
           3    Upper Whitetail
           4    Lower Whitetail
dtype: object

In [98]:
morning_frame = morning.to_frame()
morning_frame['grade'] = ['green', 'blue', 'green', 'blue', 'black diamond', 'black diamond']
morning_frame = morning_frame.set_index([0])
morning_frame

                       grade
0
Left Bank              green
West Way                blue
Winding Brook          green
Panorama                blue
Wild Turkey    black diamond
Cutter         black diamond

In [99]:
afternoon_frame = afternoon.to_frame()
afternoon_frame['grade'] = ['black diamond', 'double black diamond', 'blue black', 'black diamond', 'black diamond']
afternoon_frame = afternoon_frame.set_index([0])
afternoon_frame

                                grade
0
Wild Turkey             black diamond
Jericho          double black diamond
Bear Crossing              blue black
Upper Whitetail         black diamond
Lower Whitetail         black diamond

In [101]:
all_trails = morning_frame.combine_first(afternoon_frame)
all_trails

                                grade
0
Bear Crossing              blue black
Cutter                  black diamond
Jericho          double black diamond
Left Bank                       green
Lower Whitetail         black diamond
Panorama                         blue
Upper Whitetail         black diamond
West Way                         blue
Wild Turkey             black diamond
Winding Brook                   green

In [102]:
all_trails.reset_index()

                 0                 grade
0    Bear Crossing            blue black
1           Cutter         black diamond
2          Jericho  double black diamond
3        Left Bank                 green
4  Lower Whitetail         black diamond
5         Panorama                  blue
6  Upper Whitetail         black diamond
7         West Way                  blue
8      Wild Turkey         black diamond
9    Winding Brook                 green